УправДом/src/Documents/ОплатаИнтернет/ОплатаИнтернет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаИнтернет</name>
  <registerRecords>InformationRegister.СведенияПоИнтернету</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУслугиИнтернет</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопУслугиИнтернетВыбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>ЦенаИнтернет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДопУслугиИнтернет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/ЦеныКомунальныхУслуг/ЦеныКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКомунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачалаДейсвия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Catalogs/ВидыПлатежей/ВидыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПлатежей</name>
  <predefined>
    <items>
      <name>Газоснабжение</name>
      <description>Газоснабжение</description>
    </items>
    <items>
      <name>ДопУслугиИнтернет</name>
      <description>Допуслуги интернет</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>ТКО</name>
      <description>ТКО</description>
    </items>
    <items>
      <name>Электроснабжение</name>
      <description>Электроснабжение</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправДом/src/Documents/ОплатаИнтернет/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнениеШапкиНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПлатежей.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.ВидыПлатежей КАК ВидыПлатежей
		|ГДЕ
		|	ВидыПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидПлатежа);
	

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	
		Объект.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	Иначе 
		 Сообщить("Ошибка.Заполните справочники в настройках")
	 КонецЕсли;
	 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеШапкиНаСервере();
	Если Объект.ДанныеПлатежа.Количество() = 0 Тогда
		Элементы.ДанныеПлатежа.ДобавитьСтроку();	
	КонецЕсли;
	
	Если Объект.ДопУслугиИнтернетВыбор = Ложь Тогда
		Элементы.ДанныеПлатежаДопУслугиИнтернетЦена.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДопУслугиИнтернетВыборПриИзменении(Элемент)
	ТекДан = Элементы.ДанныеПлатежа.ТекущиеДанные;
	Если Объект.ДопУслугиИнтернетВыбор = Ложь Тогда
		Элементы.ДанныеПлатежаДопУслугиИнтернетЦена.Видимость = Ложь;
		ТекДан.СуммаПлатежа = ТекДан.ЦенаИнтернет;
		//ТекДан.ЦенаДопУслугиИнтернет = 0;
	Иначе
		Элементы.ДанныеПлатежаДопУслугиИнтернетЦена.Видимость = Истина;
		ТекДан.СуммаПлатежа = ТекДан.ЦенаИнтернет + ТекДан.ЦенаДопУслугиИнтернет;
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Функция ЗаполнениеТЧНаСервере()
	    
    // получаем актуальные цены по Интернету и ДопУслугиИнтернет
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныКомунальныхУслугСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ВидПлатежа
		|				И КодМесяца <= &КодМесяца) КАК ЦеныКомунальныхУслугСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныКомунальныхУслугСрезПоследних.Период УБЫВ";
		
					
	Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	//Запрос.УстановитьПараметр("ИнтернетДоп", Объект.ДопУслугиИнтернет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	 
        Цена = Выборка.Цена;
		//ЦенаДоп = Выборка.ЦенаДоп;
	Иначе
		Сообщить("Цена за интернет не найдена");
		//Цена = 0;
	КонецЕсли; 
	
	
	
	// получаем актуальные цены по  ДопУслугиИнтернет
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныКомунальныхУслугСрезПоследних.Цена, 0) КАК ЦенаДоп
		|ИЗ
		|	РегистрСведений.ЦеныКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ИнтернетДоп
		|				И КодМесяца <= &КодМесяца) КАК ЦеныКомунальныхУслугСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныКомунальныхУслугСрезПоследних.Период УБЫВ";
	
	//Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	Запрос.УстановитьПараметр("ИнтернетДоп", Объект.ДопУслугиИнтернет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	 
		//Цена = Выборка.Цена;
		ЦенаДоп = Выборка.ЦенаДоп;
	Иначе
		Сообщить("Цена за Допуслуги интернет не найдена");
		//ЦенаДоп = 0;
	КонецЕсли; 

	
   
      ДанныеТЧ = Новый Структура;
//	  ДанныеТЧ.Вставить("КоличествоЧеловек",КоличествоЧеловек);
	  ДанныеТЧ.Вставить("ЦенаДопУслугиИнтернет",ЦенаДоп);
	  ДанныеТЧ.Вставить("ЦенаИнтернет",Цена);
	  Возврат ДанныеТЧ;
	
КонецФункции



&НаКлиенте
Процедура ОплачиваемыйМесяцПриИзменении(Элемент)
	СтрокаТЧ = ЗаполнениеТЧНаСервере();
	ТекДан = Элементы.ДанныеПлатежа.ТекущиеДанные;
    ТекДан.ЦенаИнтернет = СтрокаТЧ.ЦенаИнтернет;
	ТекДан.ЦенаДопУслугиИнтернет = СтрокаТЧ.ЦенаДопУслугиИнтернет;
	
	Если ТекДан.ЦенаИнтернет и ТекДан.ЦенаДопУслугиИнтернет <> Неопределено Тогда
		Если Объект.ДопУслугиИнтернетВыбор = Истина Тогда
		    ТекДан.СуммаПлатежа = ТекДан.ЦенаИнтернет + ТекДан.ЦенаДопУслугиИнтернет;
	    Иначе
		     ТекДан.СуммаПлатежа = ТекДан.ЦенаИнтернет;
			 //ТекДан.ЦенаДопУслугиИнтернет = 0;
		 КонецЕсли;
	 Иначе
		 Сообщить("Установите цены на услуги интернета")
	КонецЕсли;
	 
		

КонецПроцедуры

// РАБОТА С КАРТИНКАМИ

&НаКлиенте
Асинх Процедура ЗагрузитьКвитанцию(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеКвитанция = ОбещаниеФайла.Адрес; 
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеКвитанция.ПрочитатьАсинх(Поток);

		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЭтоАдресВременногоХранилища(ИзображениеКвитанция) Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеКвитанция));
	//ИначеЕсли ИзображениеКвитанция ="Очистить" Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли;
	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ИзображениеКвитанция);
	
	//Если ЭтоАдресВременногоХранилища(ИзображениеЧек) Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеЧек));
	//ИначеЕсли ИзображениеЧек ="Очистить" Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли;
    ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ИзображениеЧек);

	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ИзображениеКвитанция = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КвитанцияИзображение"); 
	ИзображениеКвитанция = ТекущийОбъект.КвитанцияИзображение.Получить();

	
	//ИзображениеЧек = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ЧекИзображение");
	ИзображениеЧек = ТекущийОбъект.ЧекИзображение.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКвитанцию(Команда)
	
	ИзображениеКвитанция = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьЧек(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеЧек = ОбещаниеФайла.Адрес;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеЧек.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧек(Команда)
	ИзображениеЧек = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры
